       01  WS-FILE-STATUS      PIC X(02).
           88 STATUS-OK                  VALUE '00'.
           88 END-OF-FILE                VALUE '10'.
           
       01  WS-ERR-STATUS       PIC X(02).
           88 ERR-FILE-OK                VALUE '00'.
