       FD  EMP-FILE
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS.
       01  EMP-RECORD.
           05 IN-ID            PIC 9(05).
           05 IN-NAME          PIC X(30).
           05 IN-WAGE          PIC S9(7)V99 COMP-3.
           05 IN-STREET        PIC X(50).
           05 IN-TELEPHONE     PIC 9(10).
