//STEP010  EXEC PGM=DB2MRGBT
//STEPLIB  DD DSN=YOUR.DB2.RUNLIB,DISP=SHR
//         DD DSN=YOUR.LOADLIB,DISP=SHR
//INFILE   DD DSN=YOUR.MVS.FB100.DATA,DISP=SHR,BUFNO=30
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
